**** Variable name examples:

#+begin_src js :results output

  // No !!!
  var 1name = 'john';

#+end_src

#+begin_src js :results output

  // JQuery...
  var $name = 'den';
  console.log($name);

  // private variables...
  var _name = 'denny';
  console.log(_name);

#+end_src

#+RESULTS:
: den
: denny

*** Var Example

#+begin_src js :results output

  var name ='John Doe';
  console.log(name);
  name = 'Dennis Mitchell';     //  Reassignment (Dynamic)
  console.log(name);

  // Initializing a variable
  var greeting;
  console.log(greeting);

#+end_src

#+RESULTS:
: John Doe
: Dennis Mitchell
: undefined

*** const

Use const type whenever possble, to make code more secure and readable

#+begin_src js :results output

  // Object
  const Person = {
      name: "Dennis",
      age: 53
      }

  console.log(Person);
  console.log(Person.name);
  console.log(typeof(Person));

  // Arrays
  const numbers = [1,2,3,4,5];
  numbers.push(6);
  
  console.log(numbers);
  console.log(numbers[4]);



#+end_src

#+RESULTS:
: { name: 'Dennis', age: 53 }
: Dennis
: object
: [ 1, 2, 3, 4, 5, 6 ]
: 5

**** Reference Examples:

#+begin_src js :results output

  // Array
  const hobbies = ['movies', 'music'];
  console.log(typeof hobbies);

  // Is Array type tip
  if (hobbies.constructor.name == 'Array') {
      console.log('hobbies is an Array');
  }

  // Check if Array

  val = Array.isArray(hobbies);


  // Objects literal
  const address = {
      city: 'Miami',
      state: 'Florida'
  }

  const today = new Date();

  console.log(today);
  console.log(typeof today);

#+end_src

#+RESULTS:
: object
: hobbies is an Array
: 2021-11-20T17:17:38.759Z
: object

*** toString, to number:
#+begin_src js :results output

  // toString()
  val = (5).toString();
  val = (true).toString();
  val = String(5);
  console.log(typeof val);

  // to Number
  val = Number('5');
  val = parseInt('100');
  val = parseFloat('100');
  console.log(val.toFixed(2));

#+end_src

#+RESULTS:
: string
: 100.00

** Arrays

#+begin_src js :results output

  // Create some arrays
const numbers = [43,56,33,23,44,36,5];
const numbers2 = new Array(22,45,33,76,54);
const fruit = ['Apple', 'Banana', 'Orange', 'Pear'];
const mixed = [22, 'Hello', true, undefined, null, {a:1, b:1}, new Date()];

let val;

// Get array length
val = numbers.length;
// Check if is array
val = Array.isArray(numbers);
// Get single value
val = numbers[3];
val = numbers[0];
// Insert into array
numbers[2] = 100;
// Find index of value
val = numbers.indexOf(36);

// MUTATING ARRAYS
// // Add on to end
// numbers.push(250);
// // Add on to front
// numbers.unshift(120);
// // Take off from end
// numbers.pop();
// // Take off from front
// numbers.shift();
// // Splice values
// numbers.splice(1,3);
// // Reverse
// numbers.reverse();

// Concatenate array
val = numbers.concat(numbers2);

// Sorting arrays
val = fruit.sort();
// val = numbers.sort();

// // Use the "compare function"
// val = numbers.sort(function(x, y){
//   return x - y;
// });

// // Reverse sort
// val = numbers.sort(function(x, y){
//   return y - x;
// });

// Find
function over50(num){
  return num > 50;
}

val = numbers.find(over50);

console.log(numbers);
console.log(val);


#+end_src

#+RESULTS:
: [
:   43, 56, 100, 23,
:   44, 36,   5
: ]
: 56

